СистемаЛиквидацииАкадемическихЗадолженностей/src/Documents/ПротоколЗаседанияКомиссии/ПротоколЗаседанияКомиссии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПротоколЗаседанияКомиссии</name>
  <basedOn>ChartOfCalculationTypes.ПланВидовРасчета</basedOn>
  <registerRecords>CalculationRegister.РасчетСтипендииСУчетомЗадолженностей</registerRecords>
  <registerRecords>AccountingRegister.ЖурналПроводок</registerRecords>
  <attributes>
    <name>ДатаЗаседания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Председатель</name>
    <type>
      <types>CatalogRef.Преподаватели</types>
    </type>
  </attributes>
  <attributes>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РезультатЗаседанияКомиссии</name>
    <attributes>
      <name>Дисциплина</name>
      <type>
        <types>CatalogRef.Дисциплины</types>
      </type>
    </attributes>
    <attributes>
      <name>Оценка</name>
      <type>
        <types>EnumRef.Оценка</types>
      </type>
    </attributes>
    <attributes>
      <name>РешениеКомиссии</name>
      <type>
        <types>EnumRef.РешениеКомиссии</types>
      </type>
    </attributes>
    <attributes>
      <name>БазоваяСтипендия</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоэффициентСнижения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаИзменения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

СистемаЛиквидацииАкадемическихЗадолженностей/src/CalculationRegisters/РасчетСтипендииСУчетомЗадолженностей/РасчетСтипендииСУчетомЗадолженностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>РасчетСтипендииСУчетомЗадолженностей</name>
  <periodicity>Month</periodicity>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ПланВидовРасчета</chartOfCalculationTypes>
  <resources>
    <name>БазоваяСтипендия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоэффициентСнижения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ПричинаИзменения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

СистемаЛиквидацииАкадемическихЗадолженностей/src/Documents/ПротоколЗаседанияКомиссии/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр РасчетСтипендииСУчетомЗадолженностей
	Движения.РасчетСтипендииСУчетомЗадолженностей.Записывать = Истина;
	Для Каждого ТекСтрокаРезультатЗаседанияКомиссии Из РезультатЗаседанияКомиссии Цикл
		Движение = Движения.РасчетСтипендииСУчетомЗадолженностей.Добавить();
		Движение.Сторно = Ложь;
		Движение.ПериодРегистрации = ДатаЗаседания;
		Движение.Студент = Студент;
		Движение.БазоваяСтипендия = ТекСтрокаРезультатЗаседанияКомиссии.БазоваяСтипендия;
		Движение.КоэффициентСнижения = ТекСтрокаРезультатЗаседанияКомиссии.КоэффициентСнижения;
		Движение.ПричинаИзменения = ТекСтрокаРезультатЗаседанияКомиссии.ПричинаИзменения;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
